Repository: common-repository/remitradar-remittance-calculator
Catalog: languages/remitradar-remittance-calculator-*.po
Languages: ru_ru

source: RemitRadar remittance calculator/widget, allows you to provide realtime exchange rates to your visitors
ru_ru: RemitRadar - калькулятор/виджет денежных переводов, который позволяет Вашим посетителям осуществлять обмен денежными средствами в реальном времени

source: RemitRadar Remittance Calculator
ru_ru: RemitRadar Калькулятор денежных переводов

source: An answer to that question.
ru_ru: Ответ на тот вопрос

source: A question that someone might have
ru_ru: Вопрос который может возникнуть у кого-то

source: Configure the plugin and add a shortcode or widget to your page
ru_ru: Настройте плагин и добавьте короткий код или виджет себе на страницу

source: Activate the plugin through the 'Plugins' menu in WordPress
ru_ru: Активируйте плагин в разделе "Плагины" в меню WordPress-а

source: Upload <code>plugin-folder</code> to the <code>/wp-content/plugins/</code> directory
ru_ru: агрузите <code>plugin-folder</code> в директорию <code>/wp-content/plugins/</code>

source: RemitRadar remittance calculator/widget, allows you to provide realtime exchange rates to your visitors. Easy installation and configuration process, let you to start streaming realtime data in seconds. This useful widget, updated regularly and provides only up to date actual information. Great widget to entertain your audience especially if your content or website is related to immigration, international business or other sectors that are dependant on the international money transfers. If you are webmaster managing website that process over 1,000,000 monthly sessions. Please get in touch with our team to set up your compensation agreement at widgets@remitradar.com
ru_ru: Калькулятор / виджет денежных переводов RemitRadar, позволяет вам предоставлять в реальном времени обменные курсы для ваших посетителей. Простой процесс установки и настройки, позволяет вам начать потоковую передачу данных в реальном времени в считанные секунды. Этот полезный виджет, регулярно обновляемый и предоставляющий только актуальную актуальную информацию. Отличный виджет для развлечения аудитории, особенно если ваш контент или веб-сайт связаны с иммиграцией, международным бизнесом или другими секторами, которые зависят от международных денежных переводов. Если вы веб-мастер управления веб-сайтом, который обрабатывает более 1,000,000 ежемесячных сессий. Пожалуйста, свяжитесь с нашей командой, чтобы установить компенсационное соглашение на widgets@remitradar.com

source: screenshot
ru_ru: скриншот

source: logo
ru_ru: логотип

source: added translate russian localization widgets
ru_ru: Добавлен перевод виджета на русский язык

source: add pluggin
ru_ru: добавить плагин
